Revit 2027 API
GenericZone.CreateSpaceBased Method
 Creates a new instance of a generic zone using a set of spaces and adds it to the document.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static GenericZone CreateSpaceBased(
	Document doc,
	ElementId typeId,
	string name,
	GenericZoneDomainData domainData,
	ElementId levelId,
	ISet<ElementId> spaceIds
)
Public Shared Function CreateSpaceBased (
	doc As Document,
	typeId As ElementId,
	name As String,
	domainData As GenericZoneDomainData,
	levelId As ElementId,
	spaceIds As ISet(Of ElementId)
) As GenericZone
public:
static GenericZone^ CreateSpaceBased(
	Document^ doc,
	ElementId^ typeId,
	String^ name,
	GenericZoneDomainData^ domainData,
	ElementId^ levelId,
	ISet<ElementId^>^ spaceIds
)
static member CreateSpaceBased :
        doc : Document *
        typeId : ElementId *
        name : string *
        domainData : GenericZoneDomainData *
        levelId : ElementId *
        spaceIds : ISet<ElementId> -> GenericZone
Parameters
doc Document
 The document where the element will be created and added.
typeId ElementId
 The space-based element type for the new generic zone.
name String
 The name of the generic zone to be created.
domainData GenericZoneDomainData
 The specific domain requirements for the generic zone.
levelId ElementId
 The base level on which the generic zone will be created.
spaceIds ISet<ElementId>
 The associated spaces for the zone.
Return Value
GenericZone
 The newly created generic zone.
Exceptions
Exception | Condition
ArgumentException |  The element type is not a valid space-based type for this generic zone. -or- name is an empty string. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The ElementId levelId is not a Level. -or- The ElementIdSet spaceIds must be all MEP Spaces, and associated with the same level as levelId.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace